/*博客控制器*/

var mainApp = angular.module("mainApp",[]);

mainApp.controller("homecrtl",function($scope) {
  $scope.arts = [
  {"title":"javascript，这是文章标题","author":"佚名","time":"2017-2-4-5","tag":"javascript","txt":"这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，"},
  {"title":"HTML十个实用技巧","author":"倪俊","time":"2017-2-26","tag":"html","txt":"这是第二篇文章内容。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。"}
  ];
});

mainApp.controller("webcrtl",function($scope) {
  $scope.webarts = [
  {"title":"javascript，这是文章标题","author":"佚名","time":"2017-2-4-5","tag":"javascript","txt":"这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，"},
  {"title":"HTML十个实用技巧","author":"倪俊","time":"2017-2-26","tag":"html","txt":"这是第二篇文章内容。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。"}
  ];
});

mainApp.controller("notecrtl",function($scope) {
  $scope.notearts = [
  {"title":"javascript，这是文章标题","author":"佚名","time":"2017-2-4-5","tag":"javascript","txt":"这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，这是文章内容，内容很长很长，"},
  {"title":"HTML十个实用技巧","author":"倪俊","time":"2017-2-26","tag":"html","txt":"这是第二篇文章内容。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。"}
  ];
});